{
  "title": "Scratch-zu-Python-Konverter",
  "description": "So konvertieren Sie eine Scratch-Datei in Python",
  "loading": "Wird geladen...",
  "back_step1": "Gehen Sie zurück zu Schritt 1",
  "back": "zurück",
  "next": "nächste",
  "generate": "Generieren",
  "show_preview": "Vorschau zeigen",
  "close_preview": "Vorschau schließen",
  "download": "Herunterladen",
  "language": "Sprache",
  "english": "Englisch",
  "german": "Deutsch",
  "chinese": "Chinesisch",
  "step1hint": "Schritt 1: Bitte wählen Sie eine Möglichkeit aus, Ihr Scratch-Projekt in Python zu konvertieren.",
  "through_link": "Durch Link",
  "through_file": "Durch Datei",
  "step2hint": "Schritt 2: Bitte fügen Sie hier den Link zu Ihrem Scratch-Projekt ein.",
  "step2_file": "Schritt 2: Bitte laden Sie Ihre Scratch-Projektdatei hoch, die mit endet",
  "step2subhint1": "Wie folgt: (Teilen Sie zuerst Ihr Projekt)",
  "link_input_placeholder": "Fügen Sie hier den Link zu Ihrem Scratch-Projekt ein",
  "step2subhint2": "Die Schaltfläche „Weiter“ wird nicht angezeigt, wenn der Link ungültig erscheint",
  "step3hint": "Schritt 3: Wählen Sie die Sprache.",
  "step3subhint1": "Der Code in der Blackbox ist der eigentliche Befehl.",
  "step3subhint2": "Erfahren Sie mehr über Pystage!",
  "step4hint": "Schritt 4: Sehen Sie sich den generierten Code in der Vorschau an oder laden Sie ihn herunter.",
  "success_info": "Datei erfolgreich generiert!",
  "thanks_info": "Viel Spaß mit Ihrem konvertierten Scratch-Code!",
  "select_file": "Datei aussuchen",
  "tutorial" : "Klicken Sie auf ein Bild, um das Tutorial zu starten.",
  "error_in_generating": "Fehler beim Generieren der Datei!",
  "success_in_generating": "Datei erfolgreich generiert!",
  "beginner": "Anfänger",
  "mediocre": "mittelmäßig",
  "master": "Meister",
  "WebDevelopers": "Web-Entwickler",
  "beginnerTutorial": "Anfänger-Tutorial",
  "mediocreTutorial": "Mittelmäßiges Tutorial",
  "masterTutorial": "Master-Tutorial",
  "easyTutorialSentence1": "In diesem Tutorial lernen Sie, wie Sie jedes von Ihnen erstellte Scratch-Projekt in die Programmiersprache Python konvertieren.",
  "easyTutorialSentence2": "Dieses Bild unten zeigt Dot den Hund in seinem natürlichen Lebensraum, der ... SCRATCH!",
  "easyTutorialSentence3": "Klicken Sie auf den Code unten, wenn Sie erfahren möchten, wie Sie ihn selbst herstellen können!",
  "easyTutorialSentence4": "Scratch ist die weltweit größte kostenlose Programmier-Community für Kinder und ebnet den Weg für die Zukunft der Informatik.",
  "easyTutorialSentence5": "Wenn Sie zum ersten Mal Scratch verwenden, gehen Sie zu:",
  "easyTutorialSentence6": "Wenn Sie neu bei Scratch sind, klicken Sie auf „Scratch beitreten“, andernfalls klicken Sie auf „Anmelden“.",
  "easyTutorialSentence7": "Jetzt können Sie Ihr Konto erstellen und auf „Erstellen“ klicken, um Ihr Projekt zu erstellen!",
  "easyTutorialSentence8": "Sie können mit dem obigen Beispiel beginnen, wenn Sie nicht wissen, wo Sie anfangen sollen.",
  "easyTutorialSentence9": "Erfahren Sie, wie die Konvertierung funktioniert",
  "easyTutorialSentence10": "Dieses nächste Bild ist Teil dieses in Python konvertierten Projekts.",
  "easyTutorialSentence11": "Können Sie im Python-Code und im Scratch-Code erkennen, wann der Hund 10 Schritte macht?",
  "easyTutorialSentence12": "Hier ist ein einfaches Beispiel für den Konvertierungsprozess!",
  "easyTutorialSentence13": "Python-Code lernen",
  "easyTutorialSentence14": "„Selbst“ im folgenden Code bezieht sich auf das Sprite, das wir in unserem Programm verwendet haben. In diesem Fall ist unser Hund namens Dot unser Sprite.",
  "easyTutorialSentence15": "Self repräsentiert die Instanz einer Klasse und in diesem Fall unseren Hund namens Dot in seinem aktuellen Zustand.",
  "easyTutorialSentence16": "Dann wird „Selbst“ verwendet, um den Hund 10 Schritte zu bewegen und ihn zum Bellen zu bringen.",
  "easyTutorialSentence17": "definiert eine Funktion, die startet, wenn auf die grüne Flagge geklickt wird, damit der Code ausgeführt werden kann.",
  "easyTutorialSentence18": "Die PyStage-Umgebung für jedes Projekt wird im folgenden Code erstellt",
  "easyTutorialSentence19": "Deshalb umfasst unser Programm Töne, Bilder, Variablen, Kostüme und eine Bühne.",
  "easyTutorialSentence20": "Können Sie die Codezeile finden, in die Pystage die Bühne und das Sprite importiert?",
  "easyTutorialSentence21": "Wie lautet die Zahl für center_y in „dot_c“?",
  "easyTutorialSentence22": "Hinweis: Dot_c ist ein Kostüm für Dot, das seine Beine bewegt, wenn er sich bewegt.",
  "easyTutorialSentence23": "Dieses Programm läuft nicht ohne diese letzte Codezeile am Ende, die die Funktion when_program_starts_1 aufruft und die Phase startet.",
  "easyTutorialSentence24": "Ich glaube, du lernst!",
  "easyTutorialSentence25": "Um PyStage verwenden zu können, müssen Sie zunächst ein Scratch-Projekt erstellen",
  "easyTutorialSentence26": "und speichern Sie es auf Ihrem Computer oder kopieren Sie Ihren Projektlink.",
  "easyTutorialSentence27": "Fehler, die beim Generieren auftreten können",
  "easyTutorialSentence28": "Fehler beim Generieren der Datei!",
  "easyTutorialSentence29": "Das bedeutet, dass die Website den Inhalt für Ihr Projekt nicht laden konnte.",
  "easyTutorialSentence30": "Ungültige URL oder interner Fehler!",
  "easyTutorialSentence31": "Die URL ist falsch oder Scratch hat Serverprobleme, während Sie Ihr Projekt erstellen.",
  "easyTutorialSentence32": "Unbekannter Fehler",
  "easyTutorialSentence33": "Höchstwahrscheinlich gibt es etwas, das Sie in Ihrem Projekt noch nicht implementiert haben.",
  "easyTutorialSentence34": "Bedenken Sie, dass sich PyStage in der Entwicklungsphase befindet und möglicherweise noch nicht alles wie vorgesehen funktioniert.",
  "easyTutorialSentence35": "Wenn Ihr Projekt generiert wird, wird dieses Feld angezeigt und erklärt, was PyStage noch nicht implementiert hat.",
  "easyTutorialSentence36": "Bitte gehe zu",
  "easyTutorialSentence37": "wenn Sie Probleme mit PyStage melden möchten.",
  "easyTutorialSentence38": "Nachdem Ihr Projekt nun in Python konvertiert wurde, besteht der nächste Schritt darin, Ihr Projekt mit Visual Studio Code auszuführen!",
  "easyTutorialSentence39": "Wenn Sie Visual Studio Code nicht haben, können Sie es über diesen Link herunterladen",
  "easyTutorialSentence40": "Laden Sie Ihren Code auf unserer Website herunter.",
  "easyTutorialSentence41": "Nehmen Sie Ihre ZIP-Datei und entpacken Sie sie, indem Sie mit der rechten Maustaste auf die ZIP-Datei klicken und auf klicken",
  "extractHere": "hier entpacken.",
  "easyTutorialSentence42": "Denken Sie beim Speichern Ihres Projekts auf Ihrem Computer daran, in welchem ​​Ordner Sie Ihr Projekt abgelegt haben.",
  "easyTutorialSentence43": "Navigieren Sie zu Ihrem Ordner",
  "easyTutorialSentence44": "Gehen Sie zu Visual Studio Code, klicken Sie auf Datei und Ordner öffnen und öffnen Sie Ihren entpackten Ordner.",
  "easyTutorialSentence45": "Klicken Sie oben links auf Ihrem Bildschirm auf Terminal in Visual Studio Code.",
  "easyTutorialSentence46": "Navigieren Sie im Terminal mit dem Befehl cd zu Ihrem Ordner mit Ihrem entpackten Code",
  "easyTutorialSentence47": "Ihr Dateipfad unterscheidet sich möglicherweise von meinem. Hier ist ein Beispiel meines Dateipfads.",
  "easyTutorialSentence48": "Python herunterladen",
  "easyTutorialSentence49": "Wenn Sie Python noch nicht heruntergeladen haben, öffnen Sie Visual Studio Code und auf der linken Seite Ihres Bildschirms sollte eine Registerkarte mit dem Namen „Erweiterungen“ angezeigt werden.",
  "easyTutorialSentence50": "Klicken Sie auf „Erweiterungen“, geben Sie „Python“ ein und laden Sie herunter, was Sie im Bild unten sehen.",
  "easyTutorialSentence51": "Voraussetzungen für die Pip-Installation, bevor Sie beginnen",
  "easyTutorialSentence52": "Öffnen Sie das Terminal und pip install die folgenden Befehle.",
  "easyTutorialSentence53": "Führen Sie beispielsweise „pip installwheel“ aus und fahren Sie mit „pip install“ für alles fort, was in der Liste unten aufgeführt ist.",
  "easyTutorialSentence54": "Nachdem Sie Ihre Umgebung eingerichtet haben, können Sie schließlich Ihren Python-Code öffnen.",
  "easyTutorialSentence55": "Klicken Sie mit der rechten Maustaste in den Python-Dateieditor und wählen Sie „Python-Datei im Terminal ausführen“, um den Code auszuführen. Er sollte so aussehen.",
  "easyTutorialSentence56": "Sie können im Terminal auch „Python pystagedog.py“ oder einen anderen Namen Ihrer Datei eingeben.",
  "easyTutorialSentence57": "Das ist es! Viel Spaß mit Ihrem konvertierten Code!",
  "mediumTutorialSentence1": "In diesem Tutorial erfahren Sie, wie Sie ein einfaches Rubbelspiel mit einem Ziel am Ende erstellen!",
  "mediumTutorialSentence2": "Im Bild oben fehlt eine Codezeile des Spiels. Können Sie erraten, was das ist?",
  "mediumTutorialSentence3": "Die Antwort verraten wir Ihnen am Ende dieses Tutorials.",
  "mediumTutorialSentence4": "Lassen Sie uns zunächst jeden einzelnen Codeblock durchgehen und sehen, was er bewirkt.",
  "mediumTutorialSentence5": "Dieser Codeblock wird ausgeführt, wenn auf die grüne Flagge geklickt wird, zeigt eine Meldung an und setzt den Timer und die Punktzahl zurück.",
  "mediumTutorialSentence6": "Klicken Sie auf Ereignisse und ziehen Sie, wenn die grüne Flagge angeklickt wird, in den Skriptbereich.",
  "mediumTutorialSentence7": "Klicken Sie auf „Looks“, ziehen Sie den Denkblock in den Skriptbereich und schreiben Sie eine Nachricht.",
  "mediumTutorialSentence8": "Klicken Sie auf „Sensing“ und ziehen Sie „Timer zurücksetzen“ in den Skriptbereich.",
  "mediumTutorialSentence9": "Klicken Sie auf Variablen und ziehen Sie set your_score auf 0 in den Skriptbereich.",
  "mediumTutorialSentence10": "Jetzt fordere ich Sie heraus, die restlichen Blöcke selbst zu finden!",
  "mediumTutorialSentence11": "Dieser Codeblock wird ausgeführt, wenn die d-Taste gedrückt wird, wenn Sie sich im Spiel nach rechts bewegen.",
  "mediumTutorialSentence12": "Wenn Sie die Cheesy Puffs berühren, erscheint die Meldung Yum!",
  "mediumTutorialSentence13": "Dein Punktestand ändert sich dann um 1, solange du die Cheesy Puffs berührst",
  "mediumTutorialSentence14": "Sehen Sie, wie viele Punkte Sie sammeln können, bevor es verschwindet!",
  "mediumTutorialSentence15": "Dieser Code ändert x um 10 oder -10, je nachdem, ob a oder d auf Ihrer Tastatur gedrückt wird.",
  "mediumTutorialSentence16": "Der Katze wird ein neues Kostüm ausgestellt, damit die Katze so aussieht, als würde sie laufen.",
  "mediumTutorialSentence17": "Dieser Code wird verwendet, wenn die Cheesy Puffs Sprite1 berühren. (die Katze)",
  "mediumTutorialSentence18": "Wenn die grüne Flagge angeklickt wird",
  "mediumTutorialSentence19": "Die Cheesy Puffs gehen in unserem Spiel auf die Koordinaten x: 150 und y: -130.",
  "mediumTutorialSentence20": "Die Größe der Cheesy Puffs ist auf 100 % eingestellt, um alle Größenänderungen aus früheren Spielen zurückzusetzen.",
  "mediumTutorialSentence21": "Wenn die d-Taste gedrückt wird ",
  "mediumTutorialSentence22": "Wenn die Cheesy Puffs die Katze berühren, warten wir 1 Sekunde.",
  "mediumTutorialSentence23": "Versuchen Sie in dieser einen Sekunde, so viele Punkte wie möglich zu sammeln!",
  "mediumTutorialSentence24": "Dann wird die Größe auf 0 % gesetzt, was jedoch nicht dazu führt, dass die Cheesy Puffs vollständig vom Bildschirm verschwinden.",
  "mediumTutorialSentence25": "Wir haben die x- und y-Koordinaten auf -1000 gesetzt, damit Sie die Cheesy Puffs nicht auf dem Bildschirm sehen können.",
  "mediumTutorialSentence26": "Wenn Sie die grüne Flagge drücken, werden die X- und Y-Koordinaten auf ihre ursprüngliche Position zurückgesetzt."

}
